In [2]:
import pandas as pd
import sqlite3 as sql

In [3]:
#connection
conn = sql.connect('database3.sqlite')
conn

In [4]:
#connection
conn = sql.connect('database.sqlite')
conn

In [6]:
# dir(sql)

In [10]:
# dir(pd)
# read_sql_query

In [11]:
#table
'select * from Salaries'

'select * from Salaries'

In [12]:
pd.read_sql_query('select * from sqlite_master', conn)

,type,name,tbl_name,rootpage,sql
0,table,Salaries,Salaries,2,CREATE TABLE Salaries (\n Id INTEGER PRIMAR...
1,index,salaries_year_idx,Salaries,16566,CREATE INDEX salaries_year_idx ON Salaries (Year)

In [13]:
pd.read_sql_query('select * from salaries', conn)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184.25,,9999999.00,567595.43,2011,,San Francisco,
1,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,,335279.91,335279.91,2011,,San Francisco,
2,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.71,198306.9,,332343.61,332343.61,2011,,San Francisco,
3,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737,182234.59,,326373.19,326373.19,2011,,San Francisco,
4,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189082.74,,316285.74,316285.74,2011,,San Francisco,
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148648,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,,San Francisco,PT
148649,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148650,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148651,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148652,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,,San Francisco,PT

In [14]:
pd.read_sql_query('select * from salaries')

TypeError: read_sql_query() missing 1 required positional argument: 'con'

In [16]:
pd.read_sql_query('select * from Mysalaries',conn)

DatabaseError: Execution failed on sql 'select * from Mysalaries': no such table: Mysalaries

In [17]:
pd.read_sql_query(conn, 'select * from Mysalaries')

ArgumentError: Could not parse SQLAlchemy URL from string 'select * from Mysalaries'

In [12]:
#type table

In [17]:
# custom function

### table info

### null values

In [18]:
pd.read_sql_query('select * from Salaries where employeeName is null',conn)

Empty DataFrame
Columns: [Id, EmployeeName, JobTitle, BasePay, OvertimePay, OtherPay, Benefits, TotalPay, TotalPayBenefits, Year, Notes, Agency, Status]
Index: []

In [19]:
pd.read_sql_query('select * from Salaries where employeeName null',conn)

DatabaseError: Execution failed on sql 'select * from Salaries where employeeName null': near "null": syntax error

In [20]:
pd.read_sql_query('select * where employeeName is null from Salaries',conn)

DatabaseError: Execution failed on sql 'select * where employeeName is null from Salaries': near "from": syntax error

In [21]:
pd.read_sql_query('select * from Salaries where employeeName is not null', conn)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184.25,,9999999.00,567595.43,2011,,San Francisco,
1,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,,335279.91,335279.91,2011,,San Francisco,
2,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.71,198306.9,,332343.61,332343.61,2011,,San Francisco,
3,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737,182234.59,,326373.19,326373.19,2011,,San Francisco,
4,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189082.74,,316285.74,316285.74,2011,,San Francisco,
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148648,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,,San Francisco,PT
148649,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148650,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148651,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148652,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,,San Francisco,PT

In [22]:
pd.read_sql_query('select * from Salaries where employeeName not null', conn)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0,400184.25,,9999999.00,567595.43,2011,,San Francisco,
1,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,,335279.91,335279.91,2011,,San Francisco,
2,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.71,198306.9,,332343.61,332343.61,2011,,San Francisco,
3,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737,182234.59,,326373.19,326373.19,2011,,San Francisco,
4,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602,8601,189082.74,,316285.74,316285.74,2011,,San Francisco,
...,...,...,...,...,...,...,...,...,...,...,...,...,...
148648,148650,Roy I Tillery,Custodian,0,0,0,0,0.00,0.00,2014,,San Francisco,PT
148649,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148650,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148651,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,,San Francisco,
148652,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0,0,-618.13,0,-618.13,-618.13,2014,,San Francisco,PT

In [23]:
pd.read_sql_query('select * from Salaries where employeeName not is null', conn)

DatabaseError: Execution failed on sql 'select * from Salaries where employeeName not is null': near "is": syntax error

In [25]:
pd.read_sql_query('select employee Name , Jobtitle, totalpay from salaries',conn)

DatabaseError: Execution failed on sql 'select employee Name , Jobtitle, totalpay from salaries': no such column: employee

In [26]:
pd.read_sql_query('select employeeName , Jobtitle, totalpay from salaries',conn)

,EmployeeName,JobTitle,TotalPay
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,9999999.00
1,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91
2,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61
3,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19
4,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,316285.74
...,...,...,...
148648,Roy I Tillery,Custodian,0.00
148649,Not provided,Not provided,0.00
148650,Not provided,Not provided,0.00
148651,Not provided,Not provided,0.00
148652,Joe Lopez,"Counselor, Log Cabin Ranch",-618.13

In [27]:
pd.read_sql_query('select employeeName , Jobtitle, totalpay from salaries where employeename is null',conn)

Empty DataFrame
Columns: [EmployeeName, JobTitle, TotalPay]
Index: []

### distinct

In [28]:
pd.read_sql_query('select distinct JObtitle from Salaries', conn)

                                            JobTitle
0     GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                    CAPTAIN III (POLICE DEPARTMENT)
2               WIRE ROPE CABLE MAINTENANCE MECHANIC
3       DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
4                          ASSISTANT DEPUTY CHIEF II
...                                              ...
2154                    Sr Cnselor, Juv Hall (SFERS)
2155                  Forensic Toxicologist Supervis
2156                                      Conversion
2157                                       Cashier 3
2158                                    Not provided

[2159 rows x 1 columns]

In [29]:
pd.read_sql_query('select distinct(JObtitle) from Salaries', conn)

                                            JobTitle
0     GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                    CAPTAIN III (POLICE DEPARTMENT)
2               WIRE ROPE CABLE MAINTENANCE MECHANIC
3       DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
4                          ASSISTANT DEPUTY CHIEF II
...                                              ...
2154                    Sr Cnselor, Juv Hall (SFERS)
2155                  Forensic Toxicologist Supervis
2156                                      Conversion
2157                                       Cashier 3
2158                                    Not provided

[2159 rows x 1 columns]

In [30]:
pd.read_sql_query('select distinct(JObtitle) from Salaries where jobtitle != "Not provided" ', conn)

                                            JobTitle
0     GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                    CAPTAIN III (POLICE DEPARTMENT)
2               WIRE ROPE CABLE MAINTENANCE MECHANIC
3       DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
4                          ASSISTANT DEPUTY CHIEF II
...                                              ...
2153                        Marina Associate Manager
2154                    Sr Cnselor, Juv Hall (SFERS)
2155                  Forensic Toxicologist Supervis
2156                                      Conversion
2157                                       Cashier 3

[2158 rows x 1 columns]

In [31]:
pd.read_sql_query('select distinct(JObtitle) from Salaries where jobtitle != "not provided" ', conn)

                                            JobTitle
0     GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY
1                    CAPTAIN III (POLICE DEPARTMENT)
2               WIRE ROPE CABLE MAINTENANCE MECHANIC
3       DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)
4                          ASSISTANT DEPUTY CHIEF II
...                                              ...
2154                    Sr Cnselor, Juv Hall (SFERS)
2155                  Forensic Toxicologist Supervis
2156                                      Conversion
2157                                       Cashier 3
2158                                    Not provided

[2159 rows x 1 columns]

In [32]:
def sql_query(q):
    return pd.read_sql_query(q,conn)

### Alias

In [33]:
q = '''select employeename Employee, Jobtitle Title, Totalpay Pay
    from Salaries
'''

sql_query(q)

,Employee,Title,Pay
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,9999999.00
1,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91
2,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61
3,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19
4,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,316285.74
...,...,...,...
148648,Roy I Tillery,Custodian,0.00
148649,Not provided,Not provided,0.00
148650,Not provided,Not provided,0.00
148651,Not provided,Not provided,0.00
148652,Joe Lopez,"Counselor, Log Cabin Ranch",-618.13

In [34]:
q = '''select employeename Employee Name
    from Salaries
'''

sql_query(q)

DatabaseError: Execution failed on sql 'select employeename Employee Name
    from Salaries
': near "Name": syntax error

In [35]:
q = '''select employeename Employee_Name, Jobtitle MY_Title, Totalpay mY_Pay
    from Salaries
'''

sql_query(q)

,Employee_Name,MY_Title,mY_Pay
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,9999999.00
1,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91
2,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61
3,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19
4,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,316285.74
...,...,...,...
148648,Roy I Tillery,Custodian,0.00
148649,Not provided,Not provided,0.00
148650,Not provided,Not provided,0.00
148651,Not provided,Not provided,0.00
148652,Joe Lopez,"Counselor, Log Cabin Ranch",-618.13

In [36]:
q = '''select employeename 'Employee Name', Jobtitle 'MY Title', Totalpay 'mY Pay'
    from Salaries
'''

sql_query(q)

,Employee Name,MY Title,mY Pay
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,9999999.00
1,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),335279.91
2,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,332343.61
3,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",326373.19
4,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,316285.74
...,...,...,...
148648,Roy I Tillery,Custodian,0.00
148649,Not provided,Not provided,0.00
148650,Not provided,Not provided,0.00
148651,Not provided,Not provided,0.00
148652,Joe Lopez,"Counselor, Log Cabin Ranch",-618.13

In [37]:
q = '''select employeename as Employee
    from Salaries
'''

sql_query(q)

                 Employee
0          NATHANIEL FORD
1          ALBERT PARDINI
2       CHRISTOPHER CHONG
3         PATRICK GARDNER
4          DAVID SULLIVAN
...                   ...
148648      Roy I Tillery
148649       Not provided
148650       Not provided
148651       Not provided
148652          Joe Lopez

[148653 rows x 1 columns]

In [38]:
q = '''select employeename as Employee_Name
    from Salaries
'''

sql_query(q)

            Employee_Name
0          NATHANIEL FORD
1          ALBERT PARDINI
2       CHRISTOPHER CHONG
3         PATRICK GARDNER
4          DAVID SULLIVAN
...                   ...
148648      Roy I Tillery
148649       Not provided
148650       Not provided
148651       Not provided
148652          Joe Lopez

[148653 rows x 1 columns]

In [39]:
q = '''select employeename as 'Employee Name'
    from Salaries
'''

sql_query(q)

            Employee Name
0          NATHANIEL FORD
1          ALBERT PARDINI
2       CHRISTOPHER CHONG
3         PATRICK GARDNER
4          DAVID SULLIVAN
...                   ...
148648      Roy I Tillery
148649       Not provided
148650       Not provided
148651       Not provided
148652          Joe Lopez

[148653 rows x 1 columns]

### Ascending/Descending order by

In [40]:
q = '''select jobtitle Title, TotalPay Pay from salaries
    order by 2'''

sql_query(q)

                                                 Title         Pay
0                           Counselor, Log Cabin Ranch     -618.13
1           STATIONARY ENGINEER, WATER TREATMENT PLANT        0.00
2                                     TRANSIT OPERATOR        0.00
3                                           MANAGER IV        0.00
4                                Deputy Court Clerk II        0.00
...                                                ...         ...
148648                                       Captain 3   350403.41
148649                    Lieutenant, Fire Suppression   362844.66
148650                               Asst Med Examiner   390111.98
148651                                  Deputy Chief 3   471952.64
148652  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY  9999999.00

[148653 rows x 2 columns]

In [41]:
q = '''select jobtitle Title, TotalPay Pay from salaries
    order by totalpay'''

sql_query(q)

                                                 Title         Pay
0                           Counselor, Log Cabin Ranch     -618.13
1           STATIONARY ENGINEER, WATER TREATMENT PLANT        0.00
2                                     TRANSIT OPERATOR        0.00
3                                           MANAGER IV        0.00
4                                Deputy Court Clerk II        0.00
...                                                ...         ...
148648                                       Captain 3   350403.41
148649                    Lieutenant, Fire Suppression   362844.66
148650                               Asst Med Examiner   390111.98
148651                                  Deputy Chief 3   471952.64
148652  GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY  9999999.00

[148653 rows x 2 columns]

In [42]:
q = '''select jobtitle Title, TotalPay Pay from salaries
    order by 4'''

sql_query(q)

DatabaseError: Execution failed on sql 'select jobtitle Title, TotalPay Pay from salaries
    order by 4': 1st ORDER BY term out of range - should be between 1 and 2

In [43]:
q = '''select jobtitle Title, TotalPay Pay from salaries
    order by 2 desc'''

sql_query(q)

                                                 Title         Pay
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY  9999999.00
1                                       Deputy Chief 3   471952.64
2                                    Asst Med Examiner   390111.98
3                         Lieutenant, Fire Suppression   362844.66
4                                            Captain 3   350403.41
...                                                ...         ...
148648                                       Custodian        0.00
148649                                    Not provided        0.00
148650                                    Not provided        0.00
148651                                    Not provided        0.00
148652                      Counselor, Log Cabin Ranch     -618.13

[148653 rows x 2 columns]

In [44]:
q = '''select jobtitle Title, TotalPay Pay from salaries
    where jobtitle != 'Not provided'
    order by 2 desc'''

sql_query(q)

                                                 Title         Pay
0       GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY  9999999.00
1                                       Deputy Chief 3   471952.64
2                                    Asst Med Examiner   390111.98
3                         Lieutenant, Fire Suppression   362844.66
4                                            Captain 3   350403.41
...                                                ...         ...
148644                       Human Services Technician        0.00
148645                     Communications Dispatcher 2        0.00
148646                                       Custodian        0.00
148647                                       Custodian        0.00
148648                      Counselor, Log Cabin Ranch     -618.13

[148649 rows x 2 columns]

In [46]:
q = '''select jobtitle Title, TotalPay Pay, OtherPay, BasePay as Base from salaries
    where jobtitle != 'Not provided'
    order by 4'''

sql_query(q)

                          Title    Pay  OtherPay    Base
0                  Junior Clerk  83.01      0.00 -166.01
1                  Junior Clerk  61.07      0.00 -121.63
2                  Junior Clerk  54.61      0.00 -109.22
3                  Junior Clerk  53.30      0.00  -106.6
4                  Junior Clerk  51.20      0.00 -101.88
...                         ...    ...       ...     ...
148644  PS Aide Health Services  10.67     10.67
148645             Senior Clerk   5.56      5.56
148646         Police Officer 3   0.00      0.00
148647         Police Officer 3   0.00      0.00
148648         Police Officer 3   0.00      0.00

[148649 rows x 4 columns]

In [47]:
q = '''select jobtitle Title, TotalPay Pay, OtherPay, BasePay as Base from salaries
    where jobtitle != 'Not provided'
    order by basepay'''

sql_query(q)

                          Title    Pay  OtherPay    Base
0                  Junior Clerk  83.01      0.00 -166.01
1                  Junior Clerk  61.07      0.00 -121.63
2                  Junior Clerk  54.61      0.00 -109.22
3                  Junior Clerk  53.30      0.00  -106.6
4                  Junior Clerk  51.20      0.00 -101.88
...                         ...    ...       ...     ...
148644  PS Aide Health Services  10.67     10.67
148645             Senior Clerk   5.56      5.56
148646         Police Officer 3   0.00      0.00
148647         Police Officer 3   0.00      0.00
148648         Police Officer 3   0.00      0.00

[148649 rows x 4 columns]

In [48]:
q = '''select jobtitle Title, TotalPay Pay, OtherPay, BasePay as Base from salaries
    where jobtitle != 'Not provided'
    order by base'''

sql_query(q)

                          Title    Pay  OtherPay    Base
0                  Junior Clerk  83.01      0.00 -166.01
1                  Junior Clerk  61.07      0.00 -121.63
2                  Junior Clerk  54.61      0.00 -109.22
3                  Junior Clerk  53.30      0.00  -106.6
4                  Junior Clerk  51.20      0.00 -101.88
...                         ...    ...       ...     ...
148644  PS Aide Health Services  10.67     10.67
148645             Senior Clerk   5.56      5.56
148646         Police Officer 3   0.00      0.00
148647         Police Officer 3   0.00      0.00
148648         Police Officer 3   0.00      0.00

[148649 rows x 4 columns]

In [49]:
q = '''select jobtitle Title, TotalPay Pay from salaries order by 2 desc
    where jobtitle != 'Not provided'
    '''

sql_query(q)

DatabaseError: Execution failed on sql 'select jobtitle Title, TotalPay Pay from salaries order by 2 desc
    where jobtitle != 'Not provided'
    ': near "where": syntax error

### limit

In [50]:
q = '''select employeename, totalpay from salaries
    order by 2 desc limit 10'''

sql_query(q)

           EmployeeName    TotalPay
0        NATHANIEL FORD  9999999.00
1           David Shinn   471952.64
2            Amy P Hart   390111.98
3        Gary Altenberg   362844.66
4         John Goldberg   350403.41
5           Samson  Lai   347102.32
6       Ellen G Moffatt   344187.46
7  William J Coaker Jr.   339653.70
8        Gregory P Suhr   339282.07
9     Frederick Binkley   337204.86

In [51]:
q = '''select employeename, totalpay limit 10 from salaries
    order by 2 desc'''

sql_query(q)

DatabaseError: Execution failed on sql 'select employeename, totalpay limit 10 from salaries
    order by 2 desc': near "from": syntax error

### operators

In [52]:
# Show jobtitle title where overtimepay > 50k and excluded 'not provided' rows top 10 to descending
q = '''select jobtitle title, overtimepay from salaries
    where overtimepay > 50000
    and 
    overtimepay != 'Not Provided'
    order by 2 desc
    limit 10'''

sql_query(q)

                          title  OvertimePay
0  Lieutenant, Fire Suppression    220909.48
1                Deputy Sheriff    196689.18
2     EMT/Paramedic/Firefighter    192424.49
3                Deputy Sheriff    173547.73
4                Deputy Sheriff    173178.23
5                Deputy Sheriff    169659.92
6  Lieutenant, Fire Suppression    163477.81
7                   Firefighter    160418.47
8                Deputy Sheriff    156077.49
9                Deputy Sheriff    148147.92

In [ ]:
# Show All Employess With A Total Pay Between 50,000 and 75,000

In [ ]:
# Show All Employess With A Total Pay Between 50,000 and 75,000

In [ ]:
# Show All Employees With A BasePay less than 50,000 Or A TotalPay Greater Than 100,000